content/blog/kubernetes-native-phoenix-apps-part-2.md
+++
title = "Kubernetes Native Phoenix Apps: Part 2"
author = ["Shane Sveller"]
date = 2018-11-13T09:00:00-06:00
lastmod = 2018-12-04T09:36:45-06:00
tags = ["docker", "docker-compose", "elixir", "phoenix", "umbrella", "kubernetes"]
categories = ["elixir"]
draft = false
+++

One of the quickest ways to rapidly prototype and confirm that your new
Docker image is viable is to stand it up in a Docker-Compose environment. I
often skip this step nowadays but it's still a very useful validation step,
and is more generally applicable in open source projects where we can't
fully assume Kubernetes as a target.

<!--more-->

That said, **Docker Compose is in no way an appropriate mechanism for
production-grade deployments** serving paying customers. This phase of the
series is provided purely for educational purposes.

Some of these principles and some of the required Elixir code changes will
carry forward directly into the Kubernetes-based model later in the series -
particularly around how we configure our database connection and perform
seeds/migrations.

Published articles in this series:

-   [Introduction](/blog/2018/10/28/kubernetes-native-phoenix-apps-introduction/)
-   [Part 1](/blog/2018/10/28/kubernetes-native-phoenix-apps-part-1/)
-   Part 2 (this post)
-   [Part 3](/blog/2018/11/16/kubernetes-native-phoenix-apps-part-3/)


## Runtime Configuration {#runtime-configuration}

In order to make our application slightly more viable in different
deployment environments, we're going to borrow a page from the [Twelve
Factor Apps](https://12factor.net/) model, starting with the configuration for our database
connection.


### Ecto Database Connection {#ecto-database-connection}

For this first pass, we'll follow [Ecto's documentation](https://hexdocs.pm/ecto/3.0.1/Ecto.Repo.html#module-urls) to enable
runtime-configured `DATABASE_URL` during an `init/2` callback on our `Repo`:

{{< highlight elixir "linenos=table, linenostart=1, hl_lines=6-8" >}}
defmodule KubeNative.Repo do
  use Ecto.Repo,
    otp_app: :kube_native,
    adapter: Ecto.Adapters.Postgres

  def init(_type, config) do
    {:ok, Keyword.put(config, :url, System.get_env("DATABASE_URL"))}
  end
end
{{< /highlight >}}

Unfortunately, not every piece of our project can be configured as
gracefully using similar techniques. This especially includes external
libraries - which is something Ecto core team member Michał Muskała has
[written passionately and intelligently about](https://michal.muskala.eu/2017/07/30/configuring-elixir-libraries.html) in the not-too-distant past.
I'm still hoping to see some conventions on this subject emerge from the
community at large, but we are much closer to having adequate tooling on
this topic today than we were in 2017 when Michał's post was written.


### Other Configuration and Secrets {#other-configuration-and-secrets}

Here's one of the first instances where I'm going to genuinely cut some
corners and gloss over a little bit, because there's not as much
educational value in the Docker-Compose way of doing this. Some of it won't
survive intact into the Kubernetes-based implementation. Additionally,
since we're directly targeting Kubernetes in a later blog post, I will be
bypassing Docker's support for secrets management as part of their Swarm
offering.

Prior to the advent of Distillery 2, it was much harder for the community
to grok the available means to provide "late-binding" runtime-specific
information that isn't, shouldn't be, and perhaps **can't** be available at
build-time. This distinction between build-time and run-time configuration
challenged newcomers and even experienced Elixir developers. That
situation is much improved with the introduction of Distillery's
[Configuration Providers](https://hexdocs.pm/distillery/config/runtime.html#config-providers), which provide an extensible hook for sourcing
runtime information as the application starts up.

This next snippet uses the built-in [Mix Configuration Provider](https://hexdocs.pm/distillery/config/runtime.html#mix-config-provider) to keep us
in familiar territory for now. What the configuration instructs Distillery
to do is to include an in-repository file named `rel/config/config.exs`
into the release at the relative path `etc/config.exs`, and to consume
that content via the Mix configuration provider at boot-time.

Notably, **this file's contents can be extended or replaced** _after_ the
release is built, giving us a means to introduce certain configuration
details as late as possible, just before the BEAM runtime starts.

If you read the documentation about configuration providers, you'll learn
that most of the various commands are actually starting a separate BEAM
process first that **does** have access to `Mix`, calculating the derived
information, and writing it out to disk for the release to consume when it
starts "for real" moments later.

```elixir
# rel/config.exs
environment :prod do
  set config_providers: [
    {Mix.Releases.Config.Providers.Elixir, ["${RELEASE_ROOT_DIR}/etc/config.exs"]}
  ]
  set overlays: [
    {:copy, "rel/config/config.exs", "etc/config.exs"}
  ]
end
```

The content of the file is, for now, based once again on Distillery's
documentation, which highlights a few Phoenix-isms that are desirable
examples for runtime configuration.

```elixir
# rel/config/config.exs
use Mix.Config

port = String.to_integer(System.get_env("PORT") || "4000")

config :kube_native_web, KubeNativeWeb.Endpoint,
  http: [port: port],
  url: [host: System.get_env("HOSTNAME"), port: port],
  secret_key_base: System.get_env("SECRET_KEY_BASE")
```

Later in the series, we'll introduce actual data here.
