content/blog/kubernetes-native-phoenix-apps-part-2.md


## Docker Compose Environment Definition {#docker-compose-environment-definition}

> Our [application](https://github.com/shanesveller/kube-native-phoenix) relies on PostgreSQL 10, so we'll want to account for that
> in the `docker-compose.yml` we create.

This Docker-Compose environment is going to be extremely simple and
minimal, and as I mentioned at the beginning of the post, **is not
production ready**. Please don't use it for anything more than a learning
exercise or validating step on your way to Kubernetes.

Code samples are described by their preceding text below.

Full sample:

{{< highlight yaml "linenos=table, linenostart=1" >}}
# https://docs.docker.com/compose/compose-file/
version: '3.7'
services:
  kube_native:
    build: .
    depends_on:
      - postgres
    environment:
      DATABASE_URL: ecto://kube_native:kube_native@postgres/kube_native
      HOSTNAME: localhost
      PORT: 4000
      # mix phx.gen.secret
      SECRET_KEY_BASE: fzBk8OEcI8thGxlypWPUqfR2w2WopdN8v8pmpuy2JNj2eerbYFnlecuVMrFPGYnW
    ports:
      - 4000:4000

  postgres:
    image: postgres:10.5-alpine
    environment:
      POSTGRES_DB: kube_native
      POSTGRES_PASSWORD: kube_native
      POSTGRES_USER: kube_native
    ports:
      - 15432:5432
    volumes:
      - postgres-data:/var/lib/postgresql/data

volumes:
  postgres-data: {}
{{< /highlight >}}

We're specifying that this file should be parsed as Docker Compose's YAML
format with version `3.7` of the schema specifically, which requires Docker
`18.06` or newer. In this usage, we're not doing anything sophisticated and
it would be possible to migrate the file to an older standard without much
trouble. The compatibility matrix between Docker-Compose and Docker is
available [here](https://docs.docker.com/compose/compose-file/#compose-and-docker-compatibility-matrix). This same page describes all of the available keys in the
YAML schema as well as what values are acceptable for each, so it's a
valuable resource during our time with Docker-Compose.

Next up we start a YAML list of `services`, which are reflected as running
Docker containers after running commands such as `docker-compose up`.

{{< highlight yaml "linenos=table, linenostart=1" >}}
# https://docs.docker.com/compose/compose-file/
version: '3.7'
services:
{{< /highlight >}}


### Application Container {#application-container}

We define a **service** for the application itself, and tell it to build the
Docker image from the local working directory using the Dockerfile we
authored during [Part 1](/blog/2018/10/28/kubernetes-native-phoenix-apps-part-1/). This syntax also describes a logical dependency on
another **service** within this file, as our Phoenix app won't be very happy
without its database. This syntax will influence the order of operations
during the `docker-compose up` command and also ensure that the `postgres`
service is running whenever we try to start the `kube_native` service.

We set an environment variable named `DATABASE_URL` using [Ecto's URL
syntax](https://hexdocs.pm/ecto/Ecto.Repo.html#module-urls). The hostname can be `postgres` here because we're trying to reach a
sibling container that is defined within the same `docker-compose.yml`
file. The credentials are given in the form
`user:password@hostname/database_name`, prefixed with a pseudo-protocol of
`ecto://`, and we're going to preset those details in the Postgres
container farther down.

Matching the content from our [Other Conifguration and Secrets](#other-configuration-and-secrets) section
above, we've also set environment variables governing the hostname and port
the application should use in calculating its own URLs, and we've set a
`SECRET_KEY_BASE` with a fresh value provided by the `mix phx.gen.secret`
task. This last information should be considered sensitive and would not
typically be committed with the application's source, except perhaps in an
encrypted form.

Lastly, we expose the running application on the host machine (which will
be OSX itself for Docker For Mac users) on TCP port 4000 so that we can
contact it with a regular browser.

{{< highlight yaml "linenos=table, linenostart=4, hl_lines=6-10" >}}
kube_native:
  build: .
  depends_on:
    - postgres
  environment:
    DATABASE_URL: ecto://kube_native:kube_native@postgres/kube_native
    HOSTNAME: localhost
    PORT: 4000
    # mix phx.gen.secret
    SECRET_KEY_BASE: fzBk8OEcI8thGxlypWPUqfR2w2WopdN8v8pmpuy2JNj2eerbYFnlecuVMrFPGYnW
  ports:
    - 4000:4000
{{< /highlight >}}


### PostgreSQL Container {#postgresql-container}

We set some **insecure** but human-friendly values in the Postgres container
in order to pre-populate the existence of a database, and a less-privileged
user with a known password. These details were provided to Phoenix above
using the `DATABASE_URL` environment variable.

The `port` here demonstrates the syntax one would use to avoid port
collisions with existing Postgres installs on the host machine - the
Dockerized version will listen on `5432` within the container, but that
will be mapped to `15432` when considered from outside the container.

{{< highlight yaml "linenos=table, linenostart=17, hl_lines=4-6 9-10" >}}
postgres:
  image: postgres:10.5-alpine
  environment:
    POSTGRES_DB: kube_native
    POSTGRES_PASSWORD: kube_native
    POSTGRES_USER: kube_native
  ports:
    - 15432:5432
  volumes:
    - postgres-data:/var/lib/postgresql/data
{{< /highlight >}}


## Running Migrations and Seeds {#running-migrations-and-seeds}

The Distillery documentation has an excellent [guide on running migrations](https://hexdocs.pm/distillery/guides/running%255Fmigrations.html)
in a release context, where **we don't have access to any Mix tasks** or Mix
Elixir modules. The included snippet on that page can be adopted close to
as-is for our efforts.
