content/blog/kubernetes-native-phoenix-apps-part-2.md


### Migration Module {#migration-module}

Since we won't have Mix available for our trusty `ecto.migrate` task, we
need a relatively-pure Elixir approach that will provide similar behavior
without depending on Mix.

Very little of this content, derived from the [Distillery 2.0.12
documentation](https://github.com/bitwalker/distillery/blob/2.0.12/docs/guides/running%5Fmigrations.md), needed to change for either our specific application name or
Phoenix 1.4. At the time of writing, this code snippet currently doesn't
render correctly on HexDocs, but is [still available on GitHub](https://github.com/bitwalker/distillery/blob/2.0.12/docs/guides/running%5Fmigrations.md#migration-module).

{{< highlight elixir "linenos=table, linenostart=1, hl_lines=2 3-9 11 38" >}}
# apps/kube_native/lib/kube_native/release_tasks.ex
defmodule KubeNative.ReleaseTasks do
  @start_apps [
    :crypto,
    :ssl,
    :postgrex,
    :ecto,
    :ecto_sql
  ]

  @repos Application.get_env(:kube_native, :ecto_repos, [])

  def migrate(_argv) do
    start_services()

    run_migrations()

    stop_services()
  end

  def seed(_argv) do
    start_services()

    run_migrations()

    run_seeds()

    stop_services()
  end

  defp start_services do
    IO.puts("Starting dependencies..")
    # Start apps necessary for executing migrations
    Enum.each(@start_apps, &Application.ensure_all_started/1)

    # Start the Repo(s) for app
    IO.puts("Starting repos..")
    Enum.each(@repos, & &1.start_link(pool_size: 2))
  end

  defp stop_services do
    IO.puts("Success!")
    :init.stop()
  end

  defp run_migrations do
    Enum.each(@repos, &run_migrations_for/1)
  end

  defp run_migrations_for(repo) do
    app = Keyword.get(repo.config, :otp_app)
    IO.puts("Running migrations for #{app}")
    migrations_path = priv_path_for(repo, "migrations")
    Ecto.Migrator.run(repo, migrations_path, :up, all: true)
  end

  defp run_seeds do
    Enum.each(@repos, &run_seeds_for/1)
  end

  defp run_seeds_for(repo) do
    # Run the seed script if it exists
    seed_script = priv_path_for(repo, "seeds.exs")

    if File.exists?(seed_script) do
      IO.puts("Running seed script..")
      Code.eval_file(seed_script)
    end
  end

  defp priv_path_for(repo, filename) do
    app = Keyword.get(repo.config, :otp_app)

    repo_underscore =
      repo
      |> Module.split()
      |> List.last()
      |> Macro.underscore()

    priv_dir = "#{:code.priv_dir(app)}"

    Path.join([priv_dir, repo_underscore, filename])
  end
end

{{< /highlight >}}

I've set the overall module namespace to `KubeNative` to match our
application, and ensured that both `ecto` and `ecto_sql` appear in the list
of applications to start before executing the meaningful code. These two
entries also ensure that a new dependency introduced with Ecto 3,
`telemetry`, will be started, preventing any related errors.

{{< highlight elixir "linenos=table, linenostart=1, hl_lines=2-8" >}}
defmodule KubeNative.ReleaseTasks do
  @start_apps [
    :crypto,
    :ssl,
    :postgrex,
    :ecto,
    :ecto_sql
  ]
{{< /highlight >}}

We also need to ensure that the code looks in the correct application's
configuration data to get the list of Ecto Repos that need to be present.

{{< highlight elixir "linenos=table, linenostart=10" >}}
@repos Application.get_env(:kube_native, :ecto_repos, [])
{{< /highlight >}}

As of Ecto 3, the connection pool needs to be at least `2` rather than `1`
with Ecto 2.

{{< highlight elixir "linenos=table, linenostart=30, hl_lines=8" >}}
defp start_services do
  IO.puts("Starting dependencies..")
  # Start apps necessary for executing migrations
  Enum.each(@start_apps, &Application.ensure_all_started/1)

  # Start the Repo(s) for app
  IO.puts("Starting repos..")
  Enum.each(@repos, & &1.start_link(pool_size: 2))
end
{{< /highlight >}}


### Custom Commands {#custom-commands}

We also need to create the two custom commands and enable them per the
[Distillery documentation](https://hexdocs.pm/distillery/extensibility/custom%5Fcommands.html).

We need one for migrations:

```shell
# rel/commands/migrate.sh

#!/bin/sh

release_ctl eval --mfa "KubeNative.ReleaseTasks.migrate/1" --argv -- "$@"
```

We also need one for seeds:

```shell
# rel/commands/seed.sh

#!/bin/sh

release_ctl eval --mfa "KubeNative.ReleaseTasks.seed/1" --argv -- "$@"
```

And we need to ensure that these scripts are packaged with the release:

```elixir
# rel/config.exs

# ...
release :kube_native_umbrella do
  # ...
  set commands: [
    migrate: "rel/commands/migrate.sh",
    seed: "rel/commands/seed.sh"
  ]
end

```


### Running The Migrations {#running-the-migrations}

Finally, we can put this into practice, so let's start our database and run
our migrations and seeds, both of which are currently empty.

```shell
docker-compose pull
docker-compose build --pull kube_native
docker-compose up -d postgres
docker-compose run --rm kube_native migrate
docker-compose run --rm kube_native seed
```


## Booting the application in Docker-Compose {#booting-the-application-in-docker-compose}

```shell
docker-compose up kube_native
```

You can then browse the application by visiting [http://localhost:4000](http://localhost:4000) as
normal, and should see the typical (production-style) log output in the
shell session that's running the above `docker-compose` command.

Note that this running container will not pick up any new file changes,
perform live-reload behavior, and is generally not useful for development
purposes. It's primary value is ensuring that your release is properly
configured via Distillery, and that your Dockerfile remains viable.


### Cleaning Up {#cleaning-up}

If you'd like to reset the database, or otherwise clean up after the
Docker-Compose environment, you can use the `down` subcommand, optionally
including a flag to clear the data volume as well. Without the flag, it
will still remove the containers and Docker-specific network that was
created for you.

```shell
docker-compose down --volume
```


## Code Checkpoint {#code-checkpoint}

The work presented in this post is reflected in git tag `part-2-end`
available [here](https://github.com/shanesveller/kube-native-phoenix/tree/part-2-end). You can compare these changes to the previous post [here](https://github.com/shanesveller/kube-native-phoenix/compare/part-2-start...part-2-end).


## Appendix {#appendix}


### Software/Tool Versions {#software-tool-versions}

| Software       | Version    |
|----------------|------------|
| Distillery     | 2.0.12     |
| Docker         | 18.06.1-ce |
| Docker-Compose | 1.22.0     |
| Ecto           | 3.0.1      |
| Elixir         | 1.7.4      |
| Erlang         | 21.1.1     |
| Phoenix        | 1.4.0      |
| PostgreSQL     | 10.5       |
